In [2]:
# Import libraries
import pandas as pd
import sqlite3
import sql

In [3]:
# We will sqlite3 library and create a connection
cnn = sqlite3.connect('jupyter_sql_tutorial.db')

In [4]:
# Load the SQL module to iPython
%load_ext sql

In [5]:
%sql sqlite:///jupyter_sql_tutorial.db

In [10]:
# import tables from churn clean
# contract = pd.read_csv('data/contract.csv')
# customer = pd.read_csv('data/customer.csv')
# job = pd.read_csv('data/job.csv')
# location = pd.read_csv('data/location.csv')
# payment = pd.read_csv('data/payment.csv')

In [14]:
# Import into SQLite database
# customer.to_sql('customer', cnn)
# location.to_sql('location', cnn)
# job.to_sql('job', cnn)
# payment.to_sql('payment', cnn)

In [6]:
%%sql
SELECT *
FROM Sheborgs

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(0, 'Alita', 18, 'Zalem', 8, 2019, 200000000, 404000000, None),
 (1, 'Cortana', 21, 'Halo', 9, 2001, None, None, None),
 (2, 'Major', 35, 'Ghost in the Shell', 10, 1989, 110000000, 169800000, None),
 (3, 'Seven of Nine', 24, 'Voyager', 9.5, 1997, None, None, None),
 (4, 'Pris', 3.75, 'Blade Runner', 8, 1982, 30000000, 41500000, None),
 (5, 'Ada', 1, 'Ex Machina', 8, 2014, 15000000, 36900000, None),
 (6, 'Freya', 121, 'Saturns Children', 8.5, 2008, None, None, None)]

## Source table

In [6]:
%%sql

SELECT 
    Year, COUNT(*) AS Gynoids
FROM Sheborgs
WHERE 
    Space = NOT NULL
    AND Beauty = NOT NULL
    AND Year = NOT NULL
GROUP BY Year
ORDER BY Year ASC;

 * sqlite:///jupyter_sql_tutorial.db
Done.

[]

In [7]:
%%sql

SELECT 
    l.name AS league,
    COUNT(m.country_id) AS matches
FROM league AS l
LEFT JOIN match AS m
ON l.country_id = m.country_id
GROUP BY l.name;

 * sqlite:///jupyter_sql_tutorial.db
(sqlite3.OperationalError) no such table: league
[SQL: SELECT l.name AS league,
    COUNT(m.country_id) AS matches
FROM league AS l
LEFT JOIN match AS m
ON l.country_id = m.country_id
GROUP BY l.name;]
(Background on this error at: http://sqlalche.me/e/e3q8)

#### Add filters to WHERE clause

In [8]:
%%sql

SELECT 
    date,
    id,
    home_goal,
    away_goal
FROM match
WHERE season = '2013/2014'
        AND home_team_goal > away_team_goal;

 * sqlite:///jupyter_sql_tutorial.db
(sqlite3.OperationalError) no such table: match
[SQL: SELECT date, id, home_goal,
    away_goal
FROM match
WHERE season = '2013/2014'
        AND home_team_goal > away_team_goal;]
(Background on this error at: http://sqlalche.me/e/e3q8)

## CASE statements - WHEN, THEN, ELSE . . . finished with END
#### Example:
<br>CASE WHEN x = 1 THEN 'a'
<br>&emsp; &emsp; WHEN x = 2 THEN 'b'
<br>&emsp; &emsp; ELSE 'c' END AS new_column

In [9]:
%%sql

SELECT 
    id, 
    home_goal,
    away_goal,
    CASE WHEN home_goal > away_goal THEN 'Home Team Win'
        WHEN home_goal < away_goal THEN 'Away Team Win'
        ELSE 'Tie' END AS outcome
FROM match
WHERE season = '2013/2014';

 * sqlite:///jupyter_sql_tutorial.db
(sqlite3.OperationalError) no such table: match
[SQL: SELECT id, home_goal, away_goal,
    CASE WHEN home_goal > away_goal THEN 'Home Team Win'
        WHEN home_goal < away_goal THEN 'Away Team Win'
        ELSE 'Tie' END AS outcome
FROM match
WHERE season = '2013/2014';]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [12]:
%%sql

SELECT *
FROM contract
LIMIT 10;

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(0, 1, 'Month-to-month'), (1, 2, 'One year'), (2, 3, 'Two Year')]

In [7]:
%%sql

SELECT *
FROM customer
LIMIT 10;

 * sqlite:///jupyter_sql_tutorial.db
Done.
Done.

[(0, 1, 56.251000000000005, -133.37571, 38, 'Urban', 'America/Sitka', 0, 68, 28561.99, 'Widowed', 'No', 'Male', 6.795512947000001, 172.45551899999998, 904.5361101999999, 7.9783229470000006, 10, 0, 1, 'No', 'Yes', 'Yes', 'Environmental health practitioner', 'Credit Card (automatic)', 'One year', 99927),
 (1, 2, 44.32893, -84.2408, 10446, 'Urban', 'America/Detroit', 1, 27, 21704.77, 'Married', 'Yes', 'Female', 1.156680997, 242.632554, 800.9827661, 11.69907956, 12, 0, 1, 'Yes', 'No', 'Yes', 'Programmer, multimedia', 'Bank Transfer(automatic)', 'Month-to-month', 48661),
 (2, 3, 45.35589, -123.24656999999999, 3735, 'Urban', 'America/Los_Angeles', 4, 50, 9609.57, 'Widowed', 'No', 'Female', 15.75414408, 159.947583, 2054.706961, 10.75280028, 9, 0, 1, 'Yes', 'Yes', 'No', 'Chief Financial Officer', 'Credit Card (automatic)', 'Two Year', 97148),
 (3, 4, 32.96687, -117.24798, 13863, 'Suburban', 'America/Los_Angeles', 1, 48, 18925.23, 'Married', 'No', 'Male', 17.08722662, 119.95683999999999, 2164.579412, 14.91353964, 15, 2, 0, 'Yes', 'No', 'No', 'Solicitor', 'Mailed Check', 'Two Year', 92014),
 (4, 5, 29.38012, -95.80673, 11352, 'Suburban', 'America/Chicago', 0, 83, 40074.19, 'Separated', 'Yes', 'Male', 1.6709717259999999, 149.948316, 271.49343619999996, 8.147416533, 16, 2, 1, 'No', 'Yes', 'No', 'Medical illustrator', 'Mailed Check', 'Month-to-month', 77461),
 (5, 6, 32.57032, -83.8904, 17701, 'Urban', 'America/New_York', 3, 83, 22660.2, 'Never Married', 'No', 'Female', 7.000993555, 185.007692, 1039.357983, 8.420992898, 15, 3, 1, 'No', 'Yes', 'No', 'Chief Technology Officer', 'Electronic Check', 'One year', 31030),
 (6, 7, 36.4342, -84.27892, 2535, 'Suburban', 'America/New_York', 0, 79, 11467.5, 'Widowed', 'Yes', 'Male', 13.23677381, 200.118516, 1907.2429719999998, 11.18272453, 10, 0, 1, 'Yes', 'No', 'No', 'Surveyor, hydrographic', 'Electronic Check', 'Month-to-month', 37847),
 (7, 8, 35.43313, -97.52463, 23144, 'Suburban', 'America/Chicago', 2, 30, 26759.64, 'Married', 'Yes', 'Female', 4.26425515, 114.950905, 979.6127078, 7.791632265, 16, 0, 0, 'Yes', 'No', 'No', 'Sales promotion account executive', 'Mailed Check', 'Month-to-month', 73109),
 (8, 9, 28.276459999999997, -81.16273000000001, 17351, 'Suburban', 'America/New_York', 2, 49, 58634.51, 'Separated', 'No', 'Nonbinary', 8.220686373, 117.46859099999999, 1312.874964, 5.739005915, 20, 2, 3, 'No', 'Yes', 'No', 'Teaching laboratory technician', 'Bank Transfer(automatic)', 'Month-to-month', 34771),
 (9, 10, 39.19296, -84.4523, 20193, 'Rural', 'America/New_York', 1, 86, 50231.4, 'Married', 'No', 'Female', 3.4220861389999997, 162.48269399999998, 508.7637913, 8.707823904, 18, 1, 0, 'No', 'Yes', 'No', 'Museum education officer', 'Mailed Check', 'Two Year', 45237)]

In [9]:
%%sql

SELECT *
FROM job
LIMIT 10;

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(0, 1, 'Academic librarian'),
 (1, 2, 'Accommodation manager'),
 (2, 3, 'Accountant, chartered'),
 (3, 4, 'Accountant, chartered certified'),
 (4, 5, 'Accountant, chartered management'),
 (5, 6, 'Accountant, chartered public finance'),
 (6, 7, 'Accounting technician'),
 (7, 8, 'Actor'),
 (8, 9, 'Actuary'),
 (9, 10, 'Acupuncturist')]

In [10]:
%%sql

SELECT *
FROM location
LIMIT 10;

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(0, 1, 601, 'Adjuntas', 'PR', 'Adjuntas'),
 (1, 2, 610, 'Anasco', 'PR', 'Añasco'),
 (2, 3, 647, 'Ensenada', 'PR', 'Guánica'),
 (3, 4, 652, 'Garrochales', 'PR', 'Arecibo'),
 (4, 5, 662, 'Isabela', 'PR', 'Isabela'),
 (5, 6, 667, 'Lajas', 'PR', 'Lajas'),
 (6, 7, 674, 'Manati', 'PR', 'Manatí'),
 (7, 8, 683, 'San German', 'PR', 'San Germán'),
 (8, 9, 692, 'Vega Alta', 'PR', 'Vega Alta'),
 (9, 10, 694, 'Vega Baja', 'PR', 'Vega Baja')]

In [11]:
%%sql

SELECT *
FROM payment
LIMIT 10;

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(0, 1, 'Bank Transfer(automatic)'),
 (1, 2, 'Credit Card (automatic)'),
 (2, 3, 'Electronic Check'),
 (3, 4, 'Mailed Check')]